# SEQUENCE  => Последовательность  ->  Список, Кортеж, Строка, Диапазон

# list  => Список   =>  [...]
# tuple => Кортеж   =>  (...)
# str   => Строка   =>  "..."
# range => Диапазон =>  range(...)
# -------------------------------------------------------------------
# -------------------------------------------------------------------
# variable = ['...', 123, 3.14, True, None, [1, 2, 3]]
# print(variable)


# ------------------------ GET ELEMENTS ------------------------
# l = ['a', 'b', 'c']

# --------->>>>>>>  Get from start to end  -  Получить от начала до конца
# print(l[0])  # a
# print(l[1])  # b
# print(l[2])  # c
# print(l[3])  # Error  ->  IndexError: list index out of range
# -------------------------------------------------------------------
# <<<<<<<--------- Get from end to start  -  Получить от конца до начала
# print(l[0])  # a
# print(l[-1]) # c
# print(l[-2]) # b
# print(l[-3]) # a
# print(l[-4]) # Error  ->  IndexError: list index out of range
# -------------------------------------------------------------------
# ------------------------ UPDATE ELEMENTS ------------------------
# l = ['a', 'b', 'c']

# ---------------------
# BY INDEX
# l[1] = 'w'
# print(l)  # ['a', 'w', 'c']
# l[-1] = 'z'
# print(l)  # ['a', 'w', 'z']
# ---------------------
# BY SLICE
# l[...:...:...]
# l[0:2] = ['x', 'y']
# print(l)  # ['x', 'y', 'c']
# ======
# l[0:2] = 'Hello'
# print(l)  # ['H', 'e', 'l', 'l', 'o', 'c']
# ======
# l[0:2] = 123
# print(l)  # Error  ->  TypeError: can only assign an iterable
# -------------------------------------------------------------------
# ------------------------ ADD ELEMENTS ----------------------------
# l = ['a', 'b', 'c']

# [].append(...)         ->  Добавить элемент в конец списка
# [].insert(index, ...)  ->  Добавить элемент по индексу
# [].extend([...])       ->  Добавить элементы из списка

# Example
# l.append('d')
# print(l)  # ['a', 'b', 'c', 'd']

# l.insert(1, 'x')
# print(l)  # ['a', 'x', 'b', 'c']

# l.extend(['x', 'y'])
# print(l)  # ['a', 'b', 'c', 'x', 'y']
# ---------------------------------------------------------------------
# ------------------------ DELETE ELEMENTS ----------------------------
# l = ['a', 'b', 'c']
# [].pop(index)  ->  Удалить элемент по индексу
# [].remove(...) ->  Удалить элемент по значению
# del []        ->  Удалить элемент по индексу

# l.pop()   # default index = -1
# print(l)  # ['a', 'b']

# l.pop(1)
# print(l)  # ['a', 'c']

# l.remove('a')
# print(l)    # ['b', 'c']

# del l     # Удалить список
# print(l)  # Error  ->  NameError: name 'l' is not defined

# ---------------------------------------------------------------------
# ----------------------- OTHER METHODS -------------------------------
# l = ['a', 'b', 'c']

# COPY ----------------
# z = l.copy()
# z.append('d')

# print(l)
# print(z)

# print(id(l))
# print(id(z))
# ---------------------
# CHANGE ORIGINAL LIST
# [10, 2, 4].sort(...)       # Сортировать элементы  -> [2, 4, 10]
# [1, 2, 3].reverse(...)     # Перевернуть элементы  -> [3, 2, 1]
# ---------------------
# DO NOT CHANGE ORIGINAL LIST
# l = ['a', 'b', 'c', 'c']
# l.count('c')               # Подсчитать количество элементов => 2
# x = sorted([...])          # Отсортировать элементы -> ['a', 'b', 'c', 'c']
# z = list(reversed([...]))  # Перевернуть элементы   -> ['c', 'c', 'b', 'a']
# ---------------------
# INDEX
# l = ['a', 'b', 'c', 'c']
# l.index('b') # 1
# ---------------------
# CLEAR
# l = ['a', 'b', 'c', 'c']
# l.clear()  # []

