# INPUT  ===  information from client
# =================================================================
# =================================================================
# сolor = None
# name = None
# age = None

# сolor = input("Напишите цвет который вам нравится? ")
# name = input("Как вас зовут? ")
# age = input("Сколько вам лет? ")

# print(f"""
# Вас зовут: {name},
# Вам {age} лет,
# Ваш любимый цвет: {сolor}
# """)
# =================================================================
# =================================================================
# job = None
# pet = None

# job = input("Кем вы работаете? ")
# pet = input("Какое у вас домашнее животное? ")

# print(f"""
# Вы работаете как: {job},
# оказывается ваша любимое животное: {pet}
# """)
# =================================================================
# =================================================================
# name = None
# age = None
# color = None
# pet = None

# answer = input("Хотите ли вы заполнить анкету?  Да / Нет: ").capitalize()

# if answer == "Да":
#     print("=======================================")
#     print("=======================================")
#     print("=======================================")
#     print("\n\n\nВведите ваши данные как указано ниже: ")
#     print("=======================================")
#     answer = input("Введите ваше имя, возраст, любимый цвет и питомца: ")
#     print("=======================================")
#     name, age, color, pet = answer.split()
#     print(f"""\n
#         Вас зовут: {name},
#         Вам {age} лет,
#         Ваш любимый цвет: {color},
#         Ваш питомец: {pet}\n\n """)
# else:
#     print("До свидания!")

# =================================================================
# =================================================================
# answer = input("Напишите что-нибудь: ").lower()

# if 'apple' in answer:
#     answer = answer.replace("apple", "***")
#     print(f"""Вы написали: \n{answer}""")
# else:
#     print(f"""Вы написали: \n{answer}""")
# =================================================================
# answer = input("Напишите что-нибудь: ")

# print(f"5 букв из вашего текста: {answer[0:5]}")
# =================================================================
