# 1. Напишите функцию, чтобы перевернуть строку.
# -------------------------------------
# 2. Напишите функцию, чтобы удалить символ с индексом n из непустой строки.
integet = 2
string = "Hello, world!"  # => "Helo, world!"
# -------------------------------------
# 3. Напишите функцию, чтобы удалить символы, которые имеют нечетные индексы заданной строки.
# -------------------------------------
# 4. Напишите функцию, чтобы проверить, является ли заданная строка палиндромом.
# 'madam' => True
# 'hello' => False
