
# Напишите логику, которая находит самую длинную строку в массиве строк.


def find_longest(words:list[str]) -> str:
    longest = words[0] # 'ab'
    for word in words:
        if len(word) > len(longest):
            longest = word
    return longest

words = ['a', 'ab', 'abc', 'abcd', 'abcde']
r = find_longest(words)
print(r) # 'abcde'


# =========== =========== =========== =========== =========== =========== =========== 
# =========== =========== =========== =========== =========== =========== =========== 
# Напишите логику, которая находит самую короткую строку в массиве строк.

# =========== =========== =========== =========== =========== =========== =========== 
# =========== =========== =========== =========== =========== =========== =========== 
# Напишите логику, которая находит самое большое число в массиве чисел.

# def find_max(numbers: list[int]) -> int:
#     max = numbers[0]  
#     for num in numbers:
#         if num > max:
#             max = num
#     return max

# numbers = [1, 2, 3, 4, 5]
# r = find_max(numbers)
# print(r) # 5
# =========== =========== =========== =========== =========== =========== =========== 
# =========== =========== =========== =========== =========== =========== =========== 
# 1 -intermediate-functions.
# Напишите функцию, которая принимает массив чисел и находит второе наименьшее и второе наибольшее числа.
def get_second_max_min(numbers:list[int]) -> list[int]:
    numbers.sort()
    return [numbers[1], numbers[-2]]

unsorted_numbers = [14, 1, 51, 512, 99, 5]
r = get_second_max_min(unsorted_numbers)
# print(r) # [5, 99]
# =========== =========== =========== =========== =========== =========== ===========
# =========== =========== =========== =========== =========== =========== ===========
# 2 -intermediate-functions. 
# Напишите функцию, которая принимает строку в качестве параметра 
# и преобразует первую букву каждого слова строки в верхний регистр.


def make_title(str:str) -> str:
    return str.title()

text = "This is test text"
r = make_title(text)
print(r) # "This Is Test Text"