# Напишите логику, которая проверяет, кратно ли число на 3 и 5 одновременно.
# (делится ли число и на 3 и на 5 одновременно без остатка)
# x = ...
# if x % 3 == 0 and x % 5 == 0:
#     print("Yes")
# else:
#     print("No")
# ----------------------------------------------------------------------------------------------------
# Напишите логику, которая проверяет, содержит ли строка определенный символ.
# text = "Hello world"
# symbol = "w"
# if symbol in text:
#     print("Yes")
# else:
#     print("No")
# -----------------------------------------------------------------------------------------------------
# Напишите логику, которая проверяет, начинается ли строка с определённого символа.
# text = "Hello world"
# symbol = "Hello"
# if text.startswith(symbol):
#     print("startswith YES")
# elif text.endswith(symbol):
#     print("endswith YES")
# else:
#     print("No")
# -----------------------------------------------------------------------------------------------------
